
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеПодбораБюджет", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДБФорма",,ЭтаФорма, ,,,Оповещение,);	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНаселение(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеПодбораНаселение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДБФорма",,ЭтаФорма, ,,,Оповещение,);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПрочиеПотребители(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеПодбораПрочиеПотребители", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДБФорма",,ЭтаФорма, ,,,Оповещение,);
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораБюджет(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Обход Из РезультатЗакрытия Цикл
		
		Выборка = Справочники.Контрагенты.Выбрать(Обход,,);
		
		Пока Выборка.Следующий() Цикл	
			Строка = Объект.Бюджет.Добавить();
			Строка.Контрагент = Выборка.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораНаселение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	Для каждого Обход Из РезультатЗакрытия Цикл
		
		Выборка = Справочники.Контрагенты.Выбрать(Обход,,);
		
		Пока Выборка.Следующий() Цикл	
			Строка = Объект.Население.Добавить();
			Строка.Контрагент = Выборка.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораПрочиеПотребители(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Обход Из РезультатЗакрытия Цикл
		
		Выборка = Справочники.Контрагенты.Выбрать(Обход,,);
		
		Пока Выборка.Следующий() Цикл	
			Строка = Объект.ПрочиеПотребители.Добавить();
			Строка.Контрагент = Выборка.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиДокумента(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РезультатОтвета", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Записать документ?",РежимДиалогаВопрос.ДаНет, 60);
		Возврат;
	КонецЕсли;
	
	ПросмотретьДвиженияДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПросмотретьДвиженияДокумента();
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПросмотретьДвиженияДокумента()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Регистратор", Объект.Ссылка));
	
	ОткрытьФорму("РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.Форма.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти