
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(Знач ДокументСсылка, Знач Отказ) Экспорт
	
	ПараметрыПроведения                               = Новый Структура;
    ПараметрыПроведения.Вставить("Организация",       ДокументСсылка.Организация);
    ПараметрыПроведения.Вставить("Бюджет",            ДокументСсылка.Бюджет.Выгрузить());
	ПараметрыПроведения.Вставить("Население",         ДокументСсылка.Население.Выгрузить());
	ПараметрыПроведения.Вставить("ПрочиеПотребители", ДокументСсылка.ПрочиеПотребители.Выгрузить());
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
