
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Процедура ЗаписьДвиженийДокумента(Отказ, РежимПроведения, Ссылка, ПараметрыПроведения)Экспорт 
		
		НаборЗаписей = РегистрыСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СоздатьНаборЗаписей();	
			
		Организация = ПараметрыПроведения.Организация;
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		Секунда  = 0;
		Для каждого СтрокаБюджет Из ПараметрыПроведения.Бюджет Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Период = ТекущаяДатаСеанса()+Секунда;
			Движение.Организация = Организация;
			Движение.ГруппыОтчетности = Перечисления.ДБГруппыОтчетности.Бюджет;
			Движение.Контрагенты = СтрокаБюджет.Контрагент;
			Секунда = Секунда + 1;
		КонецЦикла;
		
		Для каждого СтрокаНаселение Из ПараметрыПроведения.Население Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Период = ТекущаяДатаСеанса()+Секунда;
			Движение.Организация = Организация;
			Движение.ГруппыОтчетности = Перечисления.ДБГруппыОтчетности.Население;
			Движение.Контрагенты = СтрокаНаселение.Контрагент;
			Секунда = Секунда + 1;
		КонецЦикла;
		
		Для каждого СтрокаПрочиеПотребители Из ПараметрыПроведения.ПрочиеПотребители Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Период = ТекущаяДатаСеанса()+Секунда;
			Движение.Организация = Организация;
			Движение.ГруппыОтчетности = Перечисления.ДБГруппыОтчетности.ПрочиеПотребители;
			Движение.Контрагенты = СтрокаПрочиеПотребители.Контрагент;
			Секунда = Секунда + 1;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	#КонецОбласти
	
#КонецЕсли
