
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = ТекущаяДатаСеанса();
	Период.ДатаНачала    = Дата("01.01.0001 0:00:00");
	Период.ДатаОкончания = КонецДня(ТекДата);
	
	Выборка = Справочники.Организации.Выбрать();
	Кол = 0;
	Пока Выборка.Следующий() Цикл
	Кол = Кол + 1;
	КонецЦикла;
	
	Если Кол = 1 Тогда	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПечатнаяФОрма = ПечатьСервер();
	
	//ПечатнаяФОрма.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПечатьСервер() Экспорт
	
	Пар = Новый Структура;
	Пар.Вставить("Период", Период);
	Пар.Вставить("Организация", Организация);
	
	СсылкаОбъект = РеквизитФормыВЗначение("Объект");
	ПечатнаяФорма = СсылкаОбъект.СформироватьПечатнуюФорму(Пар);
	
	Возврат ПечатнаяФорма;
	
КонецФункции

