
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Параметры.Отбор.Свойство("Отбор") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Регистратор",
			Параметры.Отбор.Отбор,
			ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область ОбработчикиПроведения
	
	#КонецОбласти
	
	#Область ОбработчикиСобытий
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	#КонецОбласти
	
#КонецЕсли
